{
    "auth/invalid-page-token": "listUsers() içinde sağlanan sonraki sayfa belirteci geçersiz. Boş olmayan geçerli bir dize olmalıdır.",
    "auth/invalid-password": "Parola kullanıcı özelliği için sağlanan değer geçersiz. En az altı karakterden oluşan bir dize olmalıdır.",
    "auth/invalid-password-hash": "Parola karması geçerli bir bayt arabelleği olmalıdır.",
    "auth/invalid-password-salt": "Parola tuzu geçerli bir bayt arabelleği olmalıdır",
    "auth/invalid-photo-url": "photoURL kullanıcı özelliği için sağlanan değer geçersiz. Bir dize URL'si olmalıdır.",
    "auth/invalid-provider-data": " ProviderData, geçerli bir UserInfo nesneleri dizisi olmalıdır.",
    "auth/invalid-oauth-responsetype": "Yalnızca tam olarak bir OAuth responseType true olarak ayarlanmalıdır.",
    "auth/invalid-session-cookie-duration": "Oturum tanımlama bilgisi süresi, 5 dakika ile 2 hafta arasında milisaniye cinsinden geçerli bir sayı olmalıdır.",
    "auth/invalid-uid": "Sağlanan kullanıcı kimliği, en fazla 128 karakterden oluşan boş olmayan bir dize olmalıdır.",
    "auth/invalid-user-import": "İçe aktarılacak kullanıcı kaydı geçersiz.",
    "auth/maximum-user-count-exceeded": "İçe aktarmak için izin verilen maksimum kullanıcı sayısı aşıldı.",
    "auth/missing-hash-algorithm": "Parola karmaları olan kullanıcıları içe aktarmak için karma algoritmasının ve parametrelerinin sağlanması gerekir.",
    "auth/missing-uid": "Geçerli işlem için bir kullanıcı kimliği tanımlayıcısı gerekiyor.",
    "auth/missing-oauth-client-secret": "OIDC kod akışını etkinleştirmek için OAuth yapılandırma istemci sırrı gereklidir.",
    "auth/phone-number-already-exists": "Sağlanan telefonNumarası zaten mevcut bir kullanıcı tarafından kullanılıyor. Her kullanıcının benzersiz bir telefonNumarası olmalıdır.",
    "auth/project-not-found": "Yönetici SDK'larını başlatmak için kullanılan kimlik bilgisi için Firebase projesi bulunamadı. Projeniz için bir kimlik bilgisinin nasıl oluşturulacağına ve bunu kimlik doğrulaması için nasıl kullanılacağına ilişkin belgeler için Firebase projesi kurma bölümüne bakın. Yönetici SDK'ları.",

    "auth/reserved-claims": "setCustomUserClaims() için sağlanan bir veya daha fazla özel kullanıcı talebi saklıdır. Örneğin, (sub, iat, iss, exp, aud, auth_time, vb.) gibi OIDC'ye özel talepler kullanılmamalıdır. özel talepler için anahtarlar olarak.",
    "auth/session-cookie-expired": "Sağlanan Firebase oturum tanımlama bilgisinin süresi doldu.",
    "auth/session-cookie-revoked": "Firebase oturum çerezi iptal edildi.",
    "auth/uid-already-exists": "Sağlanan kullanıcı kimliği mevcut bir kullanıcı tarafından zaten kullanılıyor. Her kullanıcının benzersiz bir kullanıcı kimliği olmalıdır.",
    "auth/admin-restricted-operation": "Bu işlem yalnızca yöneticilerle sınırlıdır.",
    "auth/app-not-authorized": "Barındırıldığı alan tarafından tanımlanan bu uygulama, sağlanan API anahtarıyla Firebase Authentication'ı kullanma yetkisine sahip değil. Google API konsolunda anahtar yapılandırmanızı gözden geçirin.",
    "auth/app-not-installed": "Verilen tanımlayıcıya (Android paket adı veya iOS paket kimliği) karşılık gelen istenen mobil uygulama bu cihazda yüklü değil.",
    "auth/captcha-check-failed": "Sağlanan reCAPTCHA yanıt belirteci geçersiz, süresi dolmuş, zaten kullanılıyor veya onunla ilişkili alan, beyaz listeye alınmış alanlar listesiyle eşleşmiyor.",
    "auth/code-expired": "SMS kodunun süresi doldu. Tekrar denemek için lütfen doğrulama kodunu yeniden gönderin.",
    "auth/cordova-not-ready": "Cordova çerçevesi hazır değil.",
    "auth/cors-unsupported": "Bu tarayıcı desteklenmiyor.",
    "auth/credential-alread-in-use": "Bu kimlik bilgisi zaten farklı bir kullanıcı hesabıyla ilişkilendirilmiş.",
    "auth/custom-token-mismatch": "Özel belirteç farklı bir hedef kitleye karşılık geliyor.",
    "auth/requires-recent-login": "Bu işlem hassas ve yakın zamanda kimlik doğrulama gerektiriyor. Bu isteği yeniden denemeden önce tekrar oturum açın.",
    "auth/addict-sdk-initialized-before-auth": "Başka bir Firebase SDK'sı başlatıldı ve Yetkilendirme başlatılmadan önce Yetkilendirmeyi kullanmaya çalışıyor. Başka bir Firebase SDK'sını başlatmadan önce lütfen 'initializeAuth' veya 'getAuth'u aradığınızdan emin olun. ",

    "auth/dynamic-link-not-activated": "Lütfen Firebase Konsolunda Dinamik Bağlantıları etkinleştirin ve şartlar ve koşulları kabul edin.",
    "auth/email-change-needs-verification": "Çok faktörlü kullanıcıların her zaman doğrulanmış bir e-posta adresi olmalıdır.",
    "auth/email-already-in-use": "E-posta adresi zaten başka bir hesap tarafından kullanılıyor.",
    "auth/emulator-config-failed": "Auth örneği bir ağ araması yapmak için zaten kullanılmış. Auth artık öykünücüyü kullanacak şekilde yapılandırılamaz. 'connectAuthEmulator()' öğesini daha erken çağırmayı deneyin.",
    "auth/expired-action-code": "Eylem kodunun süresi doldu.",
    "auth/cancelled-popup-request": "Başka bir çakışan açılır pencerenin açılması nedeniyle bu işlem iptal edildi.",
    "auth/internal-error": "Dahili bir AuthError oluştu.",
    "auth/invalid-app-credential": "Telefon doğrulama isteği geçersiz bir uygulama doğrulayıcı içeriyor. reCAPTCHA belirteci yanıtı geçersiz veya süresi dolmuş.",
    "auth/invalid-app-id": "Mobil uygulama tanımlayıcısı mevcut proje için kayıtlı değil.",
    "auth/invalid-user-token": "Bu kullanıcının kimlik bilgisi bu proje için geçerli değil. Bu, kullanıcının jetonu değiştirilmişse veya kullanıcı bu API anahtarıyla ilişkili proje için değilse olabilir. ",
    "auth/invalid-auth-event": "Dahili bir AuthError oluştu.",
    "auth/invalid-verification-code": "Telefon kimlik bilgilerini oluşturmak için kullanılan SMS doğrulama kodu geçersiz. Lütfen doğrulama kodu sms'ini tekrar gönderin ve kullanıcı tarafından sağlanan doğrulama kodunu kullandığınızdan emin olun.",
    "auth/invalid-continue-uri": "İstekte sağlanan devam URL'si geçersiz.",
    "auth/invalid-cordova-configuration": "OAuth oturum açmayı etkinleştirmek için şu Cordova eklentileri yüklenmelidir: cordova-plugin-buildinfo, cordova-universal-links-plugin, cordova-plugin-browsertab, cordova-plugin-inappbrowser ve cordova-plugin-customurlscheme.",
    "auth/invalid-custom-token": "Özel belirteç biçimi yanlış. Lütfen belgeleri kontrol edin.",
    "auth/invalid-dynamic-link-domain": "Sağlanan dinamik bağlantı etki alanı mevcut proje için yapılandırılmamış veya yetkilendirilmemiş.",
    "auth/invalid-email": "E-posta adresi hatalı biçimlendirilmiş.",

    "auth/invalid-emulator-scheme": "Emülatör URL'si geçerli bir şema (http:// veya https://) ile başlamalıdır.",
    "auth/invalid-api-key": "API anahtarınız geçersiz, lütfen doğru kopyalayıp kopyalamadığınızı kontrol edin.",
    "auth/invalid-cert-hash": "Sağlanan SHA-1 sertifika karması geçersiz.",
    "auth/invalid-credential": "Verilen auth kimlik bilgisi hatalı biçimlendirilmiş veya süresi dolmuş.",
    "auth/invalid-message-payload": "Bu eyleme karşılık gelen e-posta şablonu, mesajında geçersiz karakterler içeriyor. Lütfen Firebase Konsolunda Auth e-posta şablonları bölümüne giderek düzeltin.",
    "auth/invalid-multi-factor-session": "Talep, birinci faktörde başarılı oturum açmanın geçerli bir kanıtını içermiyor.",
    "auth/invalid-oauth-provider": "EmailAuthProvider bu işlem için desteklenmiyor. Bu işlem yalnızca OAuth sağlayıcılarını destekler.",
    "auth/invalid-oauth-client-id": "Sağlanan OAuth istemci kimliği geçersiz veya belirtilen API anahtarıyla eşleşmiyor.",
    "auth/unauthorized-domain": "Bu alan, Firebase projeniz için OAuth işlemleri için yetkilendirilmemiş. Yetkili alan adlarının listesini Firebase konsolundan düzenleyin.",
    "auth/invalid-action-code": "Eylem kodu geçersiz. Bu, kod hatalı biçimlendirilmişse, süresi dolmuşsa veya zaten kullanılmışsa olabilir.",
    "auth/invalid-persistence-type": "Belirtilen kalıcılık türü geçersiz. Yalnızca yerel olabilir, oturum olabilir veya hiçbiri olabilir.",
    "auth/invalid-phone-number": "Verilen telefon numarasının biçimi yanlış. Lütfen telefon numarasını E.164 biçiminde ayrıştırılabilecek bir biçimde girin. E.164 telefon numaraları [ biçiminde yazılır. +][ülke kodu][alan kodu dahil abone numarası].",
    "auth/invalid-provider-id": "Belirtilen sağlayıcı kimliği geçersiz.",

    "auth/invalid-recipient-email": "Verilen alıcı e-posta adresi geçersiz olduğundan, bu işleme karşılık gelen e-posta gönderilemedi.",
    "auth/invalid-sender": "Bu eyleme karşılık gelen e-posta şablonu geçersiz bir gönderen e-posta adresi veya adı içeriyor. Lütfen Firebase Konsolu'ndaki Yetkilendirme e-posta şablonları bölümüne giderek düzeltin.",
    "auth/invalid-verification-id": "Telefon kimlik bilgilerini oluşturmak için kullanılan doğrulama kimliği geçersiz.",
    "auth/invalid-tenant-id": "Auth örneğinin kiracı kimliği geçersiz.",
    "auth/missing-android-pkg-name": "Android Uygulamasının yüklenmesi gerekiyorsa bir Android Paket Adı sağlanmalıdır.",
    "auth/auth-domain-config-required": "Firebase.initializeApp() öğesini çağırırken Firebase konsolundaki talimatları izleyerek authDomain'i eklediğinizden emin olun.",
    "auth/missing-app-credential": "Telefon doğrulama isteğinde bir uygulama doğrulayıcı onayı eksik. Bir reCAPTCHA yanıt belirtecinin sağlanması gerekiyor.",
    "auth/missing-verification-code": "Telefon kimlik bilgisi boş bir SMS doğrulama koduyla oluşturuldu.",
    "auth/missing-continue-uri": "İstekte bir devam URL'si sağlanmalıdır.",
    "auth/missing-iframe-start": "Dahili bir AuthError oluştu.",
    "auth/missing-ios-bundle-id": "Bir App Store Kimliği sağlanmışsa bir iOS Paket Kimliği sağlanmalıdır.",
    "auth/missing-or-invalid-nonce": "İstek, geçerli bir nonce içermiyor. Bu, sağlanan ham nonce'nin SHA-256 karma değeri, kimlik belirteci yükündeki karma nonce ile eşleşmezse oluşabilir.",
    "auth/missing-multi-factor-info": "İkinci faktör tanımlayıcı sağlanmadı.",
    "auth/missing-multi-factor-session": "İstekte, birinci faktör başarılı oturum açma kanıtı eksik.",
    "auth/missing-phone-number": "Doğrulama kodlarını göndermek için alıcı için bir telefon numarası sağlayın.",

    "auth/missing-verification-id": "Telefon kimlik bilgisi boş bir doğrulama kimliğiyle oluşturuldu.",
    "auth/app-deleted": "Bu FirebaseApp örneği silindi.",
    "auth/multi-factor-info-not-found": "Kullanıcının sağlanan tanımlayıcıyla eşleşen ikinci bir faktörü yok.",
    "auth/multi-factor-auth-required": "Oturum açma işlemini tamamlamak için ikinci bir faktörün sahiplik kanıtı gereklidir.",
    "auth/account-exist-with- Different-credential": "Aynı e-posta adresine sahip ancak farklı oturum açma kimlik bilgilerine sahip bir hesap zaten var. Bu e-posta adresiyle ilişkili bir sağlayıcı kullanarak oturum açın.",
    "auth/network-request-failed": "Bir ağ AuthError (zaman aşımı, kesintiye uğramış bağlantı veya erişilemeyen ana bilgisayar gibi) oluştu.",
    "auth/no-auth-event": "Dahili bir AuthError oluştu.",
    "auth/no-such-provider": "Kullanıcı, belirtilen sağlayıcıda bir hesaba bağlanmadı.",
    "auth/null-user": "Boş olmayan bir kullanıcı nesnesi gerektiren bir işlem için argüman olarak bir boş kullanıcı nesnesi sağlandı.",
    "auth/process-not-allowed": "Bu Firebase projesi için belirtilen oturum açma sağlayıcısı devre dışı. Bunu Firebase konsolunda, Auth bölümünün oturum açma yöntemi sekmesi altında etkinleştirin.",
    "auth/process-not-support-in-this-environment": "Bu işlem, bu uygulamanın çalıştığı ortamda desteklenmiyor. 'location.protocol' http, https veya chrome-extension olmalı ve web depolama alanı olmalıdır etkinleştirilmiş.",
    "auth/popup-blocked": "Açılır pencereyle bağlantı kurulamadı. Tarayıcı tarafından engellenmiş olabilir.",

    "auth/popup-closed-by-user": "Açılır pencere, işlem sonlandırılmadan önce kullanıcı tarafından kapatıldı.",
    "auth/provider-zaten bağlantılı": "Kullanıcı, belirtilen sağlayıcı için yalnızca bir kimliğe bağlanabilir.",
    "auth/quota-exceeded": "Projenin bu işlem için kotası aşıldı.",
    "auth/redirect-cancelled-by-user": "Yönlendirme işlemi sonlandırılmadan önce kullanıcı tarafından iptal edildi.",
    "auth/redirect-process-pending": "Bir yönlendirme oturum açma işlemi zaten beklemede.",
    "auth/rejected-credential": "İstek hatalı biçimlendirilmiş veya eşleşmeyen kimlik bilgileri içeriyor.",
    "auth/second-factor-zaten kullanımda": "İkinci faktör zaten bu hesaba kayıtlı.",
    "auth/maximum-second-factor-count-count-exceeded": "Bir kullanıcı için izin verilen maksimum saniye faktörü sayısı aşıldı.",
    "auth/tenant-id-mismatch": "Verilen kiracı kimliği, Auth örneğinin kiracı kimliğiyle eşleşmiyor",
    "auth/timeout": "İşlem zaman aşımına uğradı.",
    "auth/user-token-expired": "Kullanıcının kimlik bilgisi artık geçerli değil. Kullanıcının tekrar oturum açması gerekiyor.",
    "auth/too-many-requests": "Olağandışı etkinlik nedeniyle bu cihazdan gelen tüm istekleri engelledik. Daha sonra tekrar deneyin.",
    "auth/unauthorized-continue-uri": "Devam URL'sinin alan adı beyaz listede değil. Lütfen alanı Firebase konsolunda beyaz listeye ekleyin.",
    "auth/unsupported-first-factor": "İkinci bir faktöre kaydolmak veya çok faktörlü bir hesapla oturum açmak, desteklenen bir birinci faktörle oturum açmayı gerektirir.",
    "auth/unsupported-persistence-type": "Geçerli ortam belirtilen kalıcılık türünü desteklemiyor.",

    "auth/unsupported-tenant-operation": "Bu işlem çok kiracılı bir bağlamda desteklenmiyor.",
    "auth/unverified-email": "İşlem, doğrulanmış bir e-posta gerektiriyor.",
    "auth/user-cancelled": "Kullanıcı, uygulamanıza istediği izinleri vermedi.",
    "auth/user-not-found": "Bu tanımlayıcıya karşılık gelen kullanıcı kaydı yok. Kullanıcı silinmiş olabilir.",
    "auth/user-disabled": "Kullanıcı hesabı bir yönetici tarafından devre dışı bırakıldı.",
    "auth/user-mismatch": "Sağlanan kimlik bilgileri, daha önce oturum açmış olan kullanıcıya karşılık gelmiyor.",
    "auth/weak-password": "Parola 6 karakter veya daha uzun olmalıdır.",
    "auth/web-storage-unsupported": "Bu tarayıcı desteklenmiyor veya 3. taraf tanımlama bilgileri ve veriler devre dışı bırakılabilir.",
    "auth/already-initialized": "initializeAuth() zaten farklı seçeneklerle çağrıldı. Bu hatayı önlemek için, ilk çağrıldığı zamankiyle aynı seçeneklerle initializeAuth()'u arayın veya zaten başlatılmış olanı döndürmek için getAuth()'u arayın misal."

}
